#native

&Желудь
Процедура ПриСозданииОбъекта()
КонецПроцедуры

Функция Обработать(ВходящиеДанные) Экспорт
	Результат = Новый Массив;
	Для Каждого Элемент Из ВходящиеДанные Цикл
		Заказ = Элемент["json"];
		СуммаТоваров = 0;
		Для Каждого СтрокаЗаказа Из Заказ["lines"] Цикл
			Если СтрокаЗаказа["type"] = "goods" Тогда
				СуммаТоваров = СуммаТоваров + СуммаТовара(СтрокаЗаказа);
			КонецЕсли;
		КонецЦикла;

		Для Каждого СтрокаЗаказа Из Заказ["lines"] Цикл
			Тело = Новый Соответствие;
			Тело.Вставить("orderId", Заказ["orderId"]);
			Тело.Вставить("customer", Заказ["customer"]);
			Тело.Вставить("goodsGross", Деньги.Рубли(СуммаТоваров));
			Для Каждого Пара Из СтрокаЗаказа Цикл
				Тело.Вставить(Пара.Ключ, Пара.Значение);
			КонецЦикла;
			Item = Новый Соответствие;
			Item.Вставить("json", Тело);
			Результат.Добавить(Item);
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция СуммаТовара(СтрокаЗаказа)
	Процент = Число(?(СтрокаЗаказа["discountPercent"] = Неопределено, 0, СтрокаЗаказа["discountPercent"]));
	Сумма = Деньги.ПослеСкидки(Число(СтрокаЗаказа["price"]), Число(СтрокаЗаказа["qty"]), Процент);
	Возврат Сумма;
КонецФункции
